tutorials/uniformFlow_2Turbines_mini/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 1;

vertices
(
    ( 0     0    0   )//Node 0
    ( 1890  0    0   )//Node 1
    ( 1890  504  0   )//Node 2
    ( 0     504  0   )//Node 3
    ( 0     0    504)//Node 4
    ( 1890  0    504)//Node 5
    ( 1890  504  504)//Node 6
    ( 0     504  504)//Node 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 32 32) simpleGrading (1 1 1) 

);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
           (1 2 6 5)
        );
    }
    sides
    {
        type wall;
        faces
        (
            //North
           (2 3 7 6)

            //South
            (0 1 5 4)

            //ground
            (0 3 2 1)

            //top
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
