tutorials/uniformFlow_2Turbines_mini/constant/GNDscaling.txt
(
    (0.0 2.0)
    (0.5 2.0)
    (1.0 1.0)
)