tutorials/uniformFlow_2Turbines_mini/constant/airfoils/airfoil_20
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_20
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180.00   0.0407    0.000)
        (-175.00   0.0507    0.223)
        (-170.00   0.1055    0.405)
        (-160.00   0.2982    0.658)
        (-155.00   0.4121    0.733)
        (-150.00   0.5308    0.778)
        (-145.00   0.6503    0.795)
        (-140.00   0.7672    0.787)
        (-135.00   0.8785    0.757)
        (-130.00   0.9819    0.708)
        (-125.00   1.0756    0.641)
        (-120.00   1.1580    0.560)
        (-115.00   1.2280    0.467)
        (-110.00   1.2847    0.365)
        (-105.00   1.3274    0.255)
        (-100.00   1.3557    0.139)
        ( -95.00   1.3692    0.021)
        ( -90.00   1.3680   -0.098)
        ( -85.00   1.3521   -0.216)
        ( -80.00   1.3218   -0.331)
        ( -75.00   1.2773   -0.441)
        ( -70.00   1.2193   -0.544)
        ( -65.00   1.1486   -0.638)
        ( -60.00   1.0660   -0.720)
        ( -55.00   0.9728   -0.788)
        ( -50.00   0.8705   -0.840)
        ( -45.00   0.7611   -0.875)
        ( -40.00   0.6466   -0.889)
        ( -35.00   0.5299   -0.880)
        ( -30.00   0.4141   -0.846)
        ( -25.00   0.3030   -0.784)
        ( -24.00   0.2817   -0.768)
        ( -23.00   0.2608   -0.751)
        ( -22.00   0.2404   -0.733)
        ( -21.00   0.2205   -0.714)
        ( -20.00   0.2011   -0.693)
        ( -19.00   0.1822   -0.671)
        ( -18.00   0.1640   -0.648)
        ( -17.00   0.1465   -0.624)
        ( -16.00   0.1300   -0.601)
        ( -15.00   0.1145   -0.579)
        ( -14.00   0.1000   -0.559)
        ( -13.00   0.0867   -0.539)
        ( -12.00   0.0744   -0.519)
        ( -11.00   0.0633   -0.499)
        ( -10.00   0.0534   -0.480)
        (  -5.54   0.0245   -0.385)
        (  -5.04   0.0225   -0.359)
        (  -4.54   0.0196   -0.360)
        (  -4.04   0.0174   -0.355)
        (  -3.54   0.0162   -0.307)
        (  -3.04   0.0144   -0.246)
        (  -3.00   0.0240   -0.240)
        (  -2.50   0.0188   -0.163)
        (  -2.00   0.0160   -0.091)
        (  -1.50   0.0137   -0.019)
        (  -1.00   0.0118    0.052)
        (  -0.50   0.0104    0.121)
        (   0.00   0.0094    0.196)
        (   0.50   0.0096    0.265)
        (   1.00   0.0098    0.335)
        (   1.50   0.0099    0.404)
        (   2.00   0.0100    0.472)
        (   2.50   0.0102    0.540)
        (   3.00   0.0103    0.608)
        (   3.50   0.0104    0.674)
        (   4.00   0.0105    0.742)
        (   4.50   0.0107    0.809)
        (   5.00   0.0108    0.875)
        (   5.50   0.0109    0.941)
        (   6.00   0.0110    1.007)
        (   6.50   0.0113    1.071)
        (   7.00   0.0115    1.134)
        (   7.50   0.0117    1.198)
        (   8.00   0.0120    1.260)
        (   8.50   0.0126    1.318)
        (   9.00   0.0133    1.368)
        (   9.50   0.0143    1.422)
        (  10.00   0.0156    1.475)
        (  10.50   0.0174    1.523)
        (  11.00   0.0194    1.570)
        (  11.50   0.0227    1.609)
        (  12.00   0.0269    1.642)
        (  12.50   0.0319    1.675)
        (  13.00   0.0398    1.700)
        (  13.50   0.0488    1.717)
        (  14.00   0.0614    1.712)
        (  14.50   0.0786    1.703)
        (  15.50   0.1173    1.671)
        (  16.00   0.1377    1.649)
        (  16.50   0.1600    1.621)
        (  17.00   0.1814    1.598)
        (  17.50   0.2042    1.571)
        (  18.00   0.2316    1.549)
        (  19.00   0.2719    1.544)
        (  19.50   0.2906    1.549)
        (  20.00   0.3085    1.565)
        (  21.00   0.3447    1.565)
        (  22.00   0.3820    1.563)
        (  23.00   0.4203    1.558)
        (  24.00   0.4593    1.552)
        (  25.00   0.4988    1.546)
        (  26.00   0.5387    1.539)
        (  28.00   0.6187    1.527)
        (  30.00   0.6978    1.522)
        (  32.00   0.7747    1.529)
        (  35.00   0.8869    1.544)
        (  40.00   1.0671    1.529)
        (  45.00   1.2319    1.471)
        (  50.00   1.3747    1.376)
        (  55.00   1.4899    1.249)
        (  60.00   1.5728    1.097)
        (  65.00   1.6202    0.928)
        (  70.00   1.6302    0.750)
        (  75.00   1.6031    0.570)
        (  80.00   1.5423    0.396)
        (  85.00   1.4598    0.237)
        (  90.00   1.4041    0.101)
        (  95.00   1.4053   -0.022)
        ( 100.00   1.3914   -0.143)
        ( 105.00   1.3625   -0.261)
        ( 110.00   1.3188   -0.374)
        ( 115.00   1.2608   -0.480)
        ( 120.00   1.1891   -0.575)
        ( 125.00   1.1046   -0.659)
        ( 130.00   1.0086   -0.727)
        ( 135.00   0.9025   -0.778)
        ( 140.00   0.7883   -0.809)
        ( 145.00   0.6684   -0.818)
        ( 150.00   0.5457   -0.800)
        ( 155.00   0.4236   -0.754)
        ( 160.00   0.3066   -0.677)
        ( 170.00   0.1085   -0.417)
        ( 175.00   0.0510   -0.229)
        ( 180.00   0.0407    0.000)
    );
}
