tutorials/uniformFlow_2Turbines_mini/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*----------------------------------------------------------------------------|
|   wtActuatorFOAM:                                                           |
|                                                                             |
|    Yet another actuator library to simulate wind turbines in OpenFOAM       |
|                                                                             |
| Copyright (C) 2025 Computational Simulation Center (CSC-CONICET)--Argentina |
|                                                                             |
| This library is based on OpenFOAM: The Open Source CFD Toolbox,             |
| Copyright (C) 2011-2016 OpenFOAM Foundation,                                |
| Copyright (C) 2018-2025 OpenCFD Ltd.                                        |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Define first turbine
disk1
{
    // Mandatory entries
    type            wtActuator;
    active          on;

    // Selection set
    cellSet                     actuationDisk1;
    selectionMode               cellSet;

    // Field that the source is applied to
    fieldNames                  (U);

    // Reference density for computing aerodynamical forces in incompressible cases
    density                     1.225; // [kg/m^3]

    // Turbine characteristics
    diskArea                    12469; // turbine disk area [m^2]
    blades                      3;                  // number of blades
    diskPoint                   (630 252 252);      // turbine center point [m]
    diskDir                     (1 0 0);            // turbine orientation (pointing backwards)
    yaw                         0.0;                // yaw angle with respect to x-axis [deg]
                                                    // (positive counter clockwise)
                                                    // yaw == 360 self orienting disk

    // Actuator mesh nodes distribution in disk area
    actuatorMesh                rings; // [rings, lines]
    // rings actuator mesh parameters
    ringsParam
    {
        nodesCellsRatio             2; // aimed actuator nodes per CFD cell
        rThicknessCellsizeRatio     0.5; // Ratio ring thickness to cellSize
    }
    
    // actuatorMesh                lines; // [rings, lines]
    // // lines actuator mesh parameters
    // linesParam
    // {
    //     nodesPerLine                30;
    //     linesNumber                 3;
    // }

    // Mesh rotation options
    // meshRotation                integ;
    // meshRotParam
    // {
    //     thetaMesh_ini               0.0;
    //     omegaMesh_ini               1;
    // }

    // Actuator model used to compute aerodynamical forces [uniform, airfoil, numeric, adaptive, analytic]
    actuatorModel   uniform; // Forces computed according to uniform thrust and torque 
                                // distributions on disk area (may be corrected by tip/root factors)
    // actuatorModel   airfoil; // Forces computed according to the blade element method
                                // (needs detailed airfoils information, may be corrected by tip/root factors)
    // actuatorModel   numeric; // Forces computed according to the actuator disk model from van der Laan etal 
                                // (2015) doi: 10.1002/we.1816 
                                // (needs forcesRadialDistribution table with forces at each radial position 
                                //  for each wind speed, tip/root factors do not apply)
    // actuatorModel   adaptive; // Forces computed according to the actuator disk model from Navarro Diaz 
                                 // etal (2019) doi: 10.1016/j.jweia.2018.12.018
                                 // (needs forcesRadialDistribution table with forces at each radial position
                                 //  for each wind speed and turbine wind speed reference, 
                                 //  tip/root factors do not apply) 
    // actuatorModel   analytic; // Forces computed according to the actuator disk model from Sørensen etal 
                                 // (2020) doi: 10.1016/j.renene.2019.09.134
                                 // (may use tip/root correction factors)

    // actuatorModel  genanalytic; // Forces computed according to the actuator disk model from Sørensen (2023) 
                                   // doi: 10.5194/wes-8-1017-2023
                                   // (may use tip/root correction factors)
    // Ct_rated    0.688;  // [] (optional) Needed for generalized analytic actuator

    // How to compute the undisturbed wind speed in terms of averaged disk speed [table, induction1, induction2]
    actuatorInductionModel      table; // Use wtCurvesTable to interpolate Uref from Ud
    // actuatorInductionModel      sorensen; // Use formula from Sørensen etal (2020) 
                                             // doi: 10.1016/j.renene.2019.09.134
    // actuatorInductionModel      analytic; // Use formula: Uref = UdDir * Ct_ / Cp_

    // tip factor when aplicable [prandtl, glauert, shen, none (default)]
    // tipfactor                   prandtl;  // Prandtl tip factor Betz (1919)
    // tipfactor                   glauert;  // Tip factor from Glauert (1935). doi: 10.1007/978-3-642-91487-4_3 
    tipfactor                   shen;  // Tip factor from Shen etal (2005). doi: 10.1002/we.153

    // root factor when aplicable [glauert, sorensen, none (default)]
    // rootfactor                  glauert; // Root factor from Glauert (1935). doi: 10.1007/978-3-642-91487-4_3
    rootfactor                  sorensen; // Root factor from Sørensen (2020) doi: 10.1016/j.renene.2019.09.134
    rootfactordistance          0.17;     // Sorensen root factor only []
    
    // Calibration mode to construct actuator tables 
    calibration                 false; // [true, false (default)]
    // Calibration example
    // calibration                 true; // [true, false (default)]
    // calibrationParam
    // {
    //     Uref        7;      // [m/s] (mandatory) 
    //     Cp          0.45;   // [] (optional)
    //     Ct          0.6;    // [] (optional)
    //     omega       1;      // [rad/s] (optional)
    //     pitch       0.5;    // [deg] (optional)
    // }
    
    UdCorrection                false; // (default false) Use Ud correction from Shapiro etal (2019) doi: 10.1002/we.2376.
    gradInterpolation           true;  // Use the gradient to extrapolate Ud to node location
    
    // Flow orientation computation
    orientationRadiusFrac       1; // Diameter of sphere (wrt maxR_) where flow direction is computed

    // Parameters for selection of reduced cellSet for actuator computations (diskCells_)
    selectParam
    {
        selectRadialBoundFrac       1.15; // Diameter of sphere (wrt maxR_) where actuator cells are selected (default 1.15)
        selectAxialBoundFrac        3;    // Distance to actuator plane (wrt minSep_) that limits actuator cells selected (default 3)
    }

    // Parameters for weighting cell velocities to compute average disk velocity 
    weightParam
    {
        unifWeight                  false; // Uniform weight on every diskCells_ cell [true, false (default)]
        axialWeight                 true;  // Weighting with distance to actuator plane (gaussian) [true (default), false]
        sigmaAxialWeightFrac        2.0;   // Width of axialWeight gussian (wrt minSep_; default 2.0)
        sphereWeight                false; // Weighting with distance to actuator center (gaussian) [true, false (default)]
        maxRweight                  1.0;   // Max radial distance where cells are considered for weighting (wrt maxR_; default 1.0)
        sigmaSphereWeightFrac       0.5;   // Width of sphereWeight Gaussian (wrt maxR_; default 0.5)
    }

    // Force distribution parameters distributing nodal forces according to cells distance to node
    distribParam
    {
        sphereTolDiskFrac           1.15;    // Max radial distance where cells are considered for force smearing wrt maxR_ (default 1.15)
        distribGaussianCoeffs       (2 2 2); // Width of Gaussians for force smearing wrt minSep_ (n,t,r) (default (1 1 1))
    
        // epsilonScaling              true;    // Variable scaling of smearing factor (default false)
        // scalingTable                "./constant/GNDscaling.txt";    // Scaling factors evenly distributed along 
                                                                       // blade span (linearly interpolated)
    }

    // Input tables
    #include "./constant/wtCurvesTable_NREL5MW.txt"     // Turbine global characteristics table
    #include "./constant/blade_NREL5MW.txt"             // Blade characteristics table (Only needed for airfoil actuatorModel)
    #include "./constant/forcesRadialDistribution.txt"  // Forces distribution table (Needed for numeric and adaptive
                                                        // actuatorMode)

    // Output 
    // saveLevel                   0;  // no outActuators file
    // saveLevel                   1;  // outActuators.csv file: 
                                        // Actuator name, time [s], Uref [m/s], Ud [m/s], Cp, Ct, omega [rad/s],  
                                        // pitch [deg], Power(Uref, Cp) [W], Thrust(Uref, Ct) [N], Torque [Nm]
    saveLevel                   2; // outActuators_extended.csv thurst and toque accumulated at nodes:
                                        // Actuator name, time [s], Thrust_actuator [N], Torque_actuator [Nm],
                                        // Thrust_nodes [N], Torque_nodes [Nm], meshRot [rad]
    saveNodeForces              true;   // Save forces computed at each node [true, false] 
                                        // If calibration = true, this should be also true
}

disk2						
{						
	$disk1					
						
	cellSet	                    actuationDisk2;
    	diskPoint                   (1260 315 252);
}		
