tutorials/uniformFlow_2Turbines_mini/Allrun_serial
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication refineMesh -overwrite

rm log.topoSet

runApplication topoSet

runApplication $(getApplication)

touch case.foam

#------------------------------------------------------------------------------
